# LinePattern Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePattern Constructor
LinePattern Class See Also
---
Creates a simple line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LinePattern()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LinePattern()
```

# See Also
LinePattern Class
LinePattern Overload
Autodesk.Revit.DB Namespace